[
    "Botanika qanday bo‘limlarga ajratiladi",
    "O‘simliklarni o‘rganishda qanday usullardan foydalaniladi?",
    "O’simlik hujayrasining organoidlari (xloroplast,mitoxondriya,golji apparati)",
    "Hujayrani kimyoviy tarkibi",
    "Sferosomalar,uning tuzilishi ,turlari va vazifasini tushuntirib bering",
    "Hujayrani katta kichikligi  bo’yicha qanday xillarga bo’linadi",
    "Meyoz va mitoz jarayonini taqqoslang",
    "Hujayra tarkibidagi zaxira moddalarni tushuntirib bering",
    "O’simlik hujayrasida boradigan jarayonlarni yozing",
    "Hosil qiluvchi to’qima vauning turlariga tariff bering",
    "Yuksak o’simliklarda og’izcha aparatining qanday xillari uchraydi",
    "Ildiz metamorfazalari nima va unga misollar keltiring",
    "Kselema nurlari qanday xillarga bo’linadi",
    "Shakli o’zgargan(metamorfozlashgan) novdalar",
    "Daraxtchil o‘simliklar poyasining anatomik tuzilishini tushuntiring?",
    "Poyaning ichki tuzilishini tushuntirib bering",
    "Oddiy va murakkab barglarga tarif bering.",
    "Barglarni tomirlanishini tushuntiring",
    "Barglarda sodir bo;ladigan jarayonlarni tushuntiring",
    "Bir yoki ikki uyli gullar qaysi qismlardan iborat?",
    "Partenogenez nima?",
    "O’z-o’zidan changlanishning qanday xillari mavjud?",
    "Urug‘chi(Genetsiy)tuzilishi va xillari?",
    "Androtsey deb nimaga aytiladi va qanday tuzilishga ega",
    "Meva va urug’larni avtoxor tarqalishini tushuntirib bering",
    "Meva qatini tuzilishi ho’l va quruq meva tiplari to’g’risidagitushunchangizni yozing",
    "Chin mevalar ularni tuzilishi va xillarini  tushuntirib bering ",
    "Meva va urug’larni zooxoriya tarqalishini tushuntirib bering",
    "Gulli o’simliklarda jinsiy ko’payish jarayoni qanday amalga oshadi",
    "Tuban o’simliklarda jinsiy ko’payish jarayoni qanday amalga oshadi",
    "Qizil suvo’tlar bo’limining xarakterli xususiyatlarini yozib bering (tallomining tuzilishi, rangini belgilovchi pigmentlar tarkibi, xromatoforalari, yadrolar soni va shakli, karpogon, trixogina, anteridiy, karposporaning shakllanishi, gonimoblast iplari, sistokarpiy).",
    "Qizil suvo‘tlarning ko’payishini yoritib bering",
    "Ulotriks(Ulotrix) turkumining xarakterli xususiyatlarini bayon qiling. (sistematik o’rni, yashash sharoiti, tallomining tuzilishi, xujayra tuzilishi, zoosporalarining tuzilishi, jinsiy kupayish tipi, gametalarning tuzilishi, axamiyati).",
    "Suvo’tlarning ahamiyati yozib bering",
    "mujotsiyaning tuzilishi va ko`payishini bayon qiling",
    "Chara foetida tuzilishi va ko`payishi bayon qiling.",
    "Qo’ng’ir suvo’tlar bo’limining klassifikatsiyasi  ko’payish xillarini yoritib bering.",
    "Laminariyaning klassifikasiyasini yozib bering (bulim, sinf, tartib, turkumlar, tallom tuzilishi,usish joyi, jinsiz va jinsiy kupayishi, nasllar gallanishi, yadro fazalarning gallanishi, axamiyati)."
]